---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ElectricityFailures
source: html/504b6a30-7824-5155-7e90-d4bc2a32c266.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricityFailures

Failures related to electrical system and circuits.

## Syntax (C#)
```csharp
public static class ElectricityFailures
```